Revit 2027 API
ClassificationEntry.HasInvalidKey Method
 Checks if the key matches the level and parent key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasInvalidKey()
Public Function HasInvalidKey As Boolean
public:
bool HasInvalidKey()
member HasInvalidKey : unit -> bool
Return Value
Boolean
 True if the key doesn't matach the level and parent key. False otherwise.
See Also
Reference
ClassificationEntry Class
Autodesk.Revit.DB Namespace